package lesson1;

public class HomeWork {
/*    ------------L1: Homework:------------
1.Создайте программу, которая вычислит выражение 121 * ⅓ +388^3 и выведет результат на экран.

2.Создайте программу выводящую на экран результаты следующих вычислений: (int) ((double)7 / 3 )*10 ) % 31=?

3.Создайте программу, которая вычислит выражение 20 * ⅓+ 158² и выведет результат на экран.

4.Создайте программу, которая вычислит выражение 14/209+14ˣ(29-13²+14/3) и выведет результат на экран.
    При этом число 14 обязательно сохраните в отдельной переменной, выбрав для неё подходящий тип.

5.В переменной n хранится двузначное число. Создайте программу, вычисляющую и выводящую на экран сумму цифр n.
   */

    public static void main(String[] args) {
        double result1 = 121 * (1 / 3) + 388 * 388 * 388;
        System.out.println("121 * (1/3) + 388^3 = " + result1);

        int result2 = (int) (((double) 7 / 3) * 10) % 31;
        //int result2 = (int) (2.3333333333333 * 10) % 31;
        System.out.println("(int) (((double) 7 / 3) * 10) % 31 = " + result2);


        System.out.println("7/3=" + (7 / 3));
        System.out.println("7.0/3=" + (7.0 / 3));


        int x = 151;
        double result3 = x / 209 + x * (29 - 13 * 13 + x / 3);
        System.out.println("14/209+14ˣ(29-13²+14/3)=" + result3);

        int number = 89;
        int number1 = number / 10;
        int number2 = number % 10;
        System.out.println(number + " = " + number1 + " + " + number2);
    }
}
